Tekla.Structures.Drawing.ReinforcementBase.ReinforcementBaseAttributes
The ReinforcementBaseAttributes class is the attributes class for the reinforcement.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementBaseAttributes.ReinforcementRepresentation
The representation of reinforcing bars.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementBaseAttributes.VisibleLines
The line type of the visible lines of the reinforcement.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementBaseAttributes.HiddenLines
The line type of the hidden lines of the reinforcement.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementBaseAttributes.HideLinesHiddenByPart
Defines whether lines hidden by parts should be hidden or not.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementBaseAttributes.HideLinesHiddenByReinforcement
Defines whether lines hidden by reinforcements should be hidden or not.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementBaseAttributes.CustomPresentation
Custom presentation GUID to be applied to the object type

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementBaseAttributes.#ctor
Creates a new default Reinforcement attributes instance that loads standard attributes.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementBaseAttributes.#ctor(System.String)
Creates a new Reinforcement attributes instance that loads the specified attributes.
AttributeFile: The filename of the attribute file.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementBaseAttributes.#ctor(System.Boolean)
Creates a new Reinforcement attributes instance that does not load attributes.
SkipLoadingAttributes: If it set to true attributes won't be lodaded.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementBaseAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
AttributeFile: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.ReinforcementBase.ReinforcementBaseAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.